{"version":"1","records":[{"hierarchy":{"lvl1":"Rediscovery Channel"},"type":"lvl1","url":"/intro","position":0},{"hierarchy":{"lvl1":"Rediscovery Channel"},"content":"...and to be really sure you need to have a doubt\n\nHello! Welcome to this thing. I’m not sure what this is, but I created it with the intent of collecting all my “side projects” and publishing them in a single place. Driven by pure curiosity, I love to create mathematical models to describe phenomena, explore ideas, or solve doubts that pop up in my head. Nothing of what I’ve done is new, quite the opposite: I am obsessed with not looking anywhere for hints or solutions, except when strictly necessary, or I’m stuck for days on a single thing. And hence the name of the blog: from the italian version of “rediscovering the wheel”, that is “discovering hot water” (“hai scoperto l’acqua calda!”). It won’t be surprising that most of the things you will read here are likely well-known and derived with a bad inefficience. Many interpretations will be at the very least inaccurate. But this blog is not meant to be an enciclopedia, but rather a collection of my thoughts, ideas, and obsessions.\n\nI’ll be more than happy to receive any feedback, suggestions, or corrections!\n\n#Prepare to discover hot water with me!\n\nMarco","type":"content","url":"/intro","position":1},{"hierarchy":{"lvl1":"Personal finance"},"type":"lvl1","url":"/intro-finance","position":0},{"hierarchy":{"lvl1":"Personal finance"},"content":"Personal finance and mathematical finance","type":"content","url":"/intro-finance","position":1},{"hierarchy":{"lvl1":"Physical modelling"},"type":"lvl1","url":"/intro-physics","position":0},{"hierarchy":{"lvl1":"Physical modelling"},"content":"Here we discuss about physical modelling.\n\nAtmospheric pressure and altitude","type":"content","url":"/intro-physics","position":1},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude"},"type":"lvl1","url":"/pressure1","position":0},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude"},"content":"","type":"content","url":"/pressure1","position":1},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl2":"Introduction"},"type":"lvl2","url":"/pressure1#introduction","position":2},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl2":"Introduction"},"content":"In this chapter, we will try to find in an ab initio manner how atmospheric pressure and altitude are related to each other.","type":"content","url":"/pressure1#introduction","position":3},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl2":"The barometric formula"},"type":"lvl2","url":"/pressure1#the-barometric-formula","position":4},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl2":"The barometric formula"},"content":"We start from considering an ideal gas. This approximation works well with the Earth’s atmosphere, because it has a sufficiently low density and high temperature. From the ideal gas law, the pressure is given by:p=nk_BT\n\nwhere n the numerical density of the gas, and T its temperature. To model Earth’s atmosphere, we imagine an infinitely high column of gas that is subjected to an uniform gravitational field. This approximation stems from the assumptions that (i) Earth is spherical and that (ii) the vast majority of the gas mass stays below an altitude that is much smaller than Earth’s radius. Both approximations are very good. We will remove approximation (ii) in a later section.\n\nThe pressure of the gas at certain altitude h must be equivalent to the pressure exerted by the column of gas above it, due to the gravitational field, i.e.:p(h)=\\dfrac{M(h)g}{A}\n\nwith M the mass of the gas column, and A the area. We can calculate the mass per unit of area, M/A, as the integral of the mass density \\rho(z) of the gas along the altitude:p(h) = g\\int_h^{+\\infty}\\rho(z) dz  = g\\int_h^{+\\infty}m_0(z)n(z) dz\n\nwhere we expressed the mass density ρ as the product between the average mass of the gas particle, m_0, and the numerical density, n, both depending on the altitude. We can rearrange and convert the equation in its differential form, knowing that n(+\\infty)=0:\\dfrac{d}{dh}p(h)=-g\\,m_0(h)n(h) = -g\\,m_0(h)\\dfrac{p(h)}{k_BT(h)}\n\nWhere we used equation \n\n(1) to express the numerical density in terms of density and temperature. It is important to note that equation (6) now only depends on variables at the altitude h and its proximity (the derivative), and not on the whole gas column that sits above. This mathematical step permits us to reach for a solution, but at the cost of not being able to find the absolute value of the pressure, expect for getting it empirically. Rearranging equation \n\n(4) we have:\\dfrac{\\dfrac{d}{dh}p(h)}{p(h)}=-\\dfrac{g}{k_B}\\dfrac{m_0(h)}{T(h)}\n\nBy integrating in dz from 0 to h we eventually obtain the general solution of how the pressure varies with the altitude:p(h)=p(0)\\exp\\bigg[-\\dfrac{g}{k_B}\\int_0^h\\dfrac{m_0(z)}{T(z)}dz\\bigg]\n\nWhere p(0), the pressure at h=0, is not known, and must be obtained from the observed data. If we choose h=0 to be the sea level, then p(0) is the barometric pressure, which in standard conditions is 1013.25 hPa. We will understand how temperature and average mass vary with altitude in the following section. For now, let’s assume that are both constants and see how the pressure varies in such simple case. The resolution of the integral becomes trivial, as we have:p(h)=p(0)\\exp\\bigg[-\\dfrac{m_0gh}{k_BT}\\bigg]\n\nWe recognize m_0gh as the potential energy of a single gas particle, and k_BT its thermal energy. Wait, what? Well, I rediscovered hot water of course, as equation (9) is called barometric formula. But it is nonetheless interesting to notice that the exponential term is the Boltzmann factor (e^{-E/k_BT}), which, in a canonical ensemble (NVT, our case), represents the probability of system to be in a state with energy E. In our case, E is the potential energy of a mass in an uniform gravitational field, and the Boltzmann factor represents the probability of a particle to be at that altitude. Macroscopically, this becomes the actual pressure of the gas.","type":"content","url":"/pressure1#the-barometric-formula","position":5},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl2":"International Standard Atmosphere"},"type":"lvl2","url":"/pressure1#international-standard-atmosphere","position":6},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl2":"International Standard Atmosphere"},"content":"The International Standard Atmosphere (ISA) is model that describes how the atmospheric parameters change with altitude. It assumes a constant gravitational field, dry air, and it divides the atmosphere is various layers, with different characteristics.","type":"content","url":"/pressure1#international-standard-atmosphere","position":7},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl3":"Geopotential altitude","lvl2":"International Standard Atmosphere"},"type":"lvl3","url":"/pressure1#geopotential-altitude","position":8},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl3":"Geopotential altitude","lvl2":"International Standard Atmosphere"},"content":"Before moving on to our modelling, we need to first understand how temperature and atmospheric composition vary with altitude. Unfortunately, things are not as easy as one would tell, and digging deeper made me realize that even the concept of altitude is not trivial. The vertical distance from the Earth’s mean sea level (MSL) is called the geometric altitude. In aviation and meteorology, the geopotential altitude is used instead, and it is defined as:\n\nGeopotential altitude\n\nvertical coordinate referenced to Earth’s MSL that represents the work performed when lifting one unit of mass over one unit of length through a hypothetical space in which the acceleration of gravity is assumed constant.\n\nAs you may know, Earth’s gravitational field changes not only with altitude, but also with the latitude and, to a minor extent, longitude. The geopotential altitude arises when assuming a constant gravitational field with g_0=9.80665\\ \\mathrm{m/s^2}, the standard gravity at MSL, and it is related to potential energy, E=mg_0h. Specifically, a geopotential difference of 1\\ \\mathrm{m} corresponds to a potential energy difference of 9.80665\\ \\mathrm{J}. For example, on the North Pole, where g_{np}>g_0, a geometric height of 1\\ \\mathrm{m} corresponds to a geopotential altitude that is larger than one meter:mg_0h_{geop} = mg_{np}h_{geom} \\implies h_{geop} = \\dfrac{g_{np}}{g_{0}}h_{geom} > h_{geom}\n\nMore rigorously, denoting Earth’s radius with R, the geopotential height h is related to the geometric height z according to the formula:h = \\dfrac{R}{R+z}\\,z\n\nThe geopotential altitude is the one that we used in the section \n\nThe barometric formula, where we assumed g constant. We will get rid of this approximation in a later section.","type":"content","url":"/pressure1#geopotential-altitude","position":9},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl3":"Temperature","lvl2":"International Standard Atmosphere"},"type":"lvl3","url":"/pressure1#temperature","position":10},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl3":"Temperature","lvl2":"International Standard Atmosphere"},"content":"The variation of temperature with altitude is called lapse rate, Γ:\\Gamma = -\\dfrac{dT}{dh}\n\nLapse rates at the different atmospheric layers are usually given in °C/km. The dry air approximation gives the dry adiabatic lapse rate (DALR. \\Gamma_d):\\Gamma_d = \\dfrac{g}{c_p} = 9.8\\ ^\\circ\\mathrm{C/km}\n\nHowever, this is not a formula I obtained nor I understand, so that it is outside the scope of this blog. The key point here is that the ISA defined a set of lapse rates for each atmospheric layer. Starting from a temperature of 15°C at the MSL:\n\nTroposphere (0-11 km): 6.5 °C/km\n\nTropopause (11-20 km): 0.0 °C/km\n\nStratosphere (20-32 km): 1.0 °C/km\n\nStratosphere (32-47 km): -2.8 °C/km\n\nStratopause (47-51 km): 0.0 °C/km\n\nMesosphere (51-71 km): 2.8 °C/km\n\nMesosphere (71-84.852 km): 2.0 °C/km\n\nThere are other layers above, but can be ignored due to the atmosphere being extremely rarefied.","type":"content","url":"/pressure1#temperature","position":11},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl3":"Chemical composition","lvl2":"International Standard Atmosphere"},"type":"lvl3","url":"/pressure1#chemical-composition","position":12},{"hierarchy":{"lvl1":"Atmospheric pressure and altitude","lvl3":"Chemical composition","lvl2":"International Standard Atmosphere"},"content":"","type":"content","url":"/pressure1#chemical-composition","position":13}]}